Autodesk.Revit.DB.TextElement.GetMaximumAllowedWidth(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Returns the maximum width the text element can be created with.
Remarks:
Note that it is not necessarily a constant; it can be affected
by properties of the text type, such as the width factor.
cdda:
A document containing the new text element's type
typeId:
Id of the text type
Returns:
The maximum allowed width in paper space [ft].
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2016

Autodesk.Revit.DB.TextElement.GetMinimumAllowedWidth(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Returns the minimum width a text element can be created with.
Remarks:
Note that it is not necessarily a constant; it can be affected
by properties of the text type, such as the width factor.
cdda:
A document containing the new text element's type
typeId:
Id of the text type
Returns:
The minimum allowed width in paper space [ft].
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2016

Autodesk.Revit.DB.TextElement.GetMaximumAllowedWidth
Returns the maximum width the text element can be assigned.
Remarks:
Note that it is not necessarily a constant; it can be affected
by properties of the text and its type, such as the width factor.
Returns:
The maximum allowed width in paper space [ft].
Since:
2016

Autodesk.Revit.DB.TextElement.GetMinimumAllowedWidth
Returns the minimum width the text element can be assigned.
Remarks:
Note that it is not necessarily a constant; it can be affected
by properties of the text and its type, such as the width factor.
Returns:
The minimum allowed width in paper space [ft].
Since:
2016

Autodesk.Revit.DB.TextElement.IsTextWrappingActive
A flag identifying whether text-wrapping is currently active in this text element or not.
If text wrapping is active the width of the text box remains constant and the text will wrap.
The height of the text box will automatically adjust to accomodate the height of the text.
If text wrapping is not active the text does not wrap and the width of the text box adjusts with
the width of the longest line of text.
As the text width changes, the position of the text may change depending on the
Autodesk.Revit.DB.TextElement.HorizontalAlignment
Remarks:
This is currently a read-only property and its value is set when the text element
is created. If the element was created with a specified width or if an explicit width
was set later, the wrapping would be automatically set as active. It means that any text
line that is longer that the current width of the text-box will automatically wrapped
onto the next line.
Since:
2016

Autodesk.Revit.DB.TextElement.KeepRotatedTextReadable
A flag to control how text behaves inside a rotated text element.
Remarks:
If the property is True then the text inside the text box gets oriented
so it is readable when looking straight up at the sheet or from its right side;
in other words, the text would never be upside down.
If the value is False, however, the text's orientation strictly follows
the rotation of the text box, which means the text may be upside down when
viewed on screen or printed on a sheet.
Since:
2016

Autodesk.Revit.DB.TextElement.VerticalAlignment
Vertical alignment of the text.
Remarks:
The vertical alignment determines the way text is positioned as the text height changes.
For Top-aligned text the top of the text will remain in place.For Middle-aligned text the horizontal center line of the text  will remain in place.For Bottom-aligned text the bottom of the text will remain in place.
Changing this property will not affect the position of the text element.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2016

Autodesk.Revit.DB.TextElement.HorizontalAlignment
Horizontal alignment of the text content within the text area of the element.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2016

Autodesk.Revit.DB.TextElement.Text
The content of the element as a plain string stripped of all formating.
Remarks:
If a new text content is set, all previous formating that might have been
set on parts of the original text will be lost. After setting the new text,
only the formating parameters of the associated text type will be applied.
The value of this property can also be accessed via the TEXT_TEXT
Built-In parameter.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL

Autodesk.Revit.DB.TextElement.Coord
Position of the text (in model coordinates.)
Remarks:
The position defines a point on the edge of the text area,
not a point on the border (if a border is defined for the style.)
It means that if the width of the border gets changed, the
position of the text area remains unchanged.
The relation of the position point with respect
to the text area depends on the text alignment as follows:
For Left-aligned text the point is at the Left-Top corned of the box.
For Center-aligned text the point is at the Middle-Top corned of the box.
For Right-aligned text the point is at the Right-Top corned of the box.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: A valid point must not be father then 10 miles (approx. 16 km) from the origin.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL

Autodesk.Revit.DB.TextElement.Width
Width of the area of the text content.
Remarks:
This property supersedes the older LineWidth property which has been deprecated.
The value is in sheet units, meaning it is as when measured on a printed sheet.
The measurement is of the text content only; the border around it (if specified) is excluded.
For a text element which does is set not to use text wrapping the width is calculated
to fit the longest line (a single line, typically) of the text. A setting the width explicitly
by assigning value to this property will automatically activate text-wrapping for the element.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The given width is not valid. A valid value must be within the range
returned by the methods GetMinimumAllowedWidth and GetMaximumAllowedWidth.
Since:
2016

Autodesk.Revit.DB.TextElement.Height
Height of the area of the text content.
Remarks:
The value is in sheet units, meaning it is as when measured on a printed sheet.
The measurement is of the text content only; the border around it (if specified) is excluded.
This is a read-only property, for the height of the text area
is calculated depending on the text content and its wrapping.

Autodesk.Revit.DB.TextElement.UpDirection
Direction along the vertical axis of letters of the text note.
Remarks:
This vector points up from the base of the letters
and is always perpendicular to the base direction.
Those two vectors together define the plane of the text.

Autodesk.Revit.DB.TextElement.BaseDirection
Direction of the base line of the text element.
Remarks:
Base direction is always perpendicular to Up direction.
Those two vectors together define the plane of the text.

Autodesk.Revit.DB.TextElement.Symbol
Get the type of the TextElement object.
Remarks: The user can call this property to get the related type.

Autodesk.Revit.DB.TextElement
Base class representing text elements in Revit.
Remarks:
TextElement is a base class for other annotation classes,
like TextNote, which have additional, more specific functionality.